/// **❌ AppException - کلاس مدیریت استثناها**
///
/// این کلاس برای مدیریت خطاها در برنامه استفاده می‌شود.
/// می‌توانید هنگام پرتاب یک استثنا، پیام خاصی را مشخص کنید.
///
/// **ویژگی‌ها:**
/// - `message` پیام خطا (پیش‌فرض: "Sorry, something went wrong")
class AppException {
  /// **📝 پیام خطا**
  ///
  /// این پیام هنگام بروز خطا نمایش داده می‌شود.
  final String message;

  /// **🎯 سازنده‌ی کلاس**
  ///
  /// می‌توانید یک پیام سفارشی برای خطا مشخص کنید.
  ///
  /// **مثال:**
  /// ```dart
  /// throw AppException(message: "خطایی در ارتباط با سرور رخ داده است");
  /// ```
  AppException({this.message = 'Sorry, something went wrong'});
}
