part of 'blog_bloc.dart';

/// کلاس پایه برای تمام رویدادهای بلاک وبلاگ
///
/// این کلاس به‌عنوان یک کلاس انتزاعی عمل می‌کند و تمامی رویدادهای بلاک وبلاگ باید از آن ارث‌بری کنند.
/// از `Equatable` برای مقایسه اجسام استفاده می‌شود تا بدین‌وسیله عملیات مقایسه رویدادها به‌راحتی و به‌طور مؤثر انجام شود.
///
/// این کلاس شامل یک پیاده‌سازی پیش‌فرض برای `props` است که لیستی از اشیاء برای مقایسه را بازمی‌گرداند.
///
/// ## ویژگی‌ها:
/// - `props`: یک لیست از اشیاء که برای مقایسه استفاده می‌شود. در این کلاس پایه به‌طور پیش‌فرض خالی است.
abstract class BlogEvent extends Equatable {
  const BlogEvent();

  @override
  List<Object> get props => [];
}

/// رویداد برای دریافت اطلاعات وبلاگ
///
/// این رویداد زمانی فعال می‌شود که نیاز باشد اطلاعات وبلاگ از سرور یا منبع داده‌ای بارگذاری شود.
/// برای این رویداد هیچ داده‌ای ارسال نمی‌شود و تنها یک درخواست برای دریافت اطلاعات وبلاگ است.
///
/// ## ویژگی‌ها:
/// - هیچ ویژگی یا داده‌ای ندارد.
///
/// ## مثال استفاده:
/// ```dart
/// BlocProvider.of<BlogBloc>(context).add(GetBlogEvent());
/// ```
class GetBlogEvent extends BlogEvent {}
